<?php

use Illuminate\Database\Seeder;

class BooksTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('books')->insert([
            'id' => 1,
            'user_id' => 1,
            'name' => 'Правилно хранене. Полезни съвети и лечебни диети',
            'ISBN' => '9786191532025',
            'year' => '1999',
            'description' => 'Не съществува здравословен проблем,който да не е породен от начина на хранене. Тази книга е сборник на знания за храненето. Тя не е просто изброяване какво трябва и какво не трябва да се яде, тя съдържа информация за правилното хранене както на здравия, така и на болния човек. Авторът интересно и достъпно разказва за теорията и практиката на храненето и гладуването, за алтернативните видиве хранене - разделно, суровоядство, вегетарианство и др., представя варианти на диети при различни заболявания.',
            'cover_image' => 'https://i2.helikon.bg/products/7230/21/217230/217230_b.jpg',
            'created_at' => \Carbon\Carbon::now()->toDateTimeString(),
        ]);
    }
}
